server/loadtest.log
$ "D:\Developer\Full Stack\whatsapp clone\server\node_modules\.bin\artillery" run artillery.yml
Started phase 0, duration: 120s @ 22:22:04(+0200) 2020-05-20
Report @ 22:22:14(+0200) 2020-05-20
Elapsed time: 12 seconds
  Scenarios launched:  58
  Scenarios completed: 58
  Requests completed:  174
  Mean response/sec: 17.61
  Response time (msec):
    min: 5.4
    max: 274.6
    median: 27.1
    p95: 73.2
    p99: 215.2
  Codes:
    200: 174

Report @ 22:22:24(+0200) 2020-05-20
Elapsed time: 22 seconds
  Scenarios launched:  53
  Scenarios completed: 52
  Requests completed:  157
  Mean response/sec: 16.56
  Response time (msec):
    min: 5.1
    max: 174
    median: 27.2
    p95: 60.2
    p99: 165.3
  Codes:
    200: 157

Report @ 22:22:34(+0200) 2020-05-20
Elapsed time: 32 seconds
  Scenarios launched:  82
  Scenarios completed: 82
  Requests completed:  246
  Mean response/sec: 24.6
  Response time (msec):
    min: 4.6
    max: 142.5
    median: 26.8
    p95: 58.9
    p99: 117
  Codes:
    200: 246

Report @ 22:22:44(+0200) 2020-05-20
Elapsed time: 42 seconds
  Scenarios launched:  83
  Scenarios completed: 84
  Requests completed:  251
  Mean response/sec: 25.03
  Response time (msec):
    min: 4
    max: 223.6
    median: 26.7
    p95: 91.3
    p99: 201.4
  Codes:
    200: 251

Report @ 22:22:54(+0200) 2020-05-20
Elapsed time: 52 seconds
  Scenarios launched:  101
  Scenarios completed: 99
  Requests completed:  301
  Mean response/sec: 30.33
  Response time (msec):
    min: 4.2
    max: 99.4
    median: 26.6
    p95: 55.2
    p99: 83.4
  Codes:
    200: 301

Report @ 22:23:04(+0200) 2020-05-20
Elapsed time: 1 minute, 2 seconds
  Scenarios launched:  122
  Scenarios completed: 123
  Requests completed:  367
  Mean response/sec: 37.73
  Response time (msec):
    min: 4.4
    max: 85.8
    median: 26.6
    p95: 58.6
    p99: 65
  Codes:
    200: 367

Report @ 22:23:14(+0200) 2020-05-20
Elapsed time: 1 minute, 12 seconds
  Scenarios launched:  135
  Scenarios completed: 134
  Requests completed:  404
  Mean response/sec: 40.7
  Response time (msec):
    min: 4.4
    max: 90.2
    median: 26.7
    p95: 61.3
    p99: 67.8
  Codes:
    200: 404

Report @ 22:23:24(+0200) 2020-05-20
Elapsed time: 1 minute, 22 seconds
  Scenarios launched:  134
  Scenarios completed: 135
  Requests completed:  403
  Mean response/sec: 40.24
  Response time (msec):
    min: 4.3
    max: 92.1
    median: 26.7
    p95: 58.3
    p99: 70.7
  Codes:
    200: 403

Report @ 22:23:34(+0200) 2020-05-20
Elapsed time: 1 minute, 32 seconds
  Scenarios launched:  146
  Scenarios completed: 146
  Requests completed:  438
  Mean response/sec: 43.84
  Response time (msec):
    min: 4.4
    max: 108.7
    median: 26.6
    p95: 65
    p99: 93.1
  Codes:
    200: 438

Report @ 22:23:44(+0200) 2020-05-20
Elapsed time: 1 minute, 42 seconds
  Scenarios launched:  172
  Scenarios completed: 170
  Requests completed:  512
  Mean response/sec: 51.3
  Response time (msec):
    min: 4.3
    max: 267.4
    median: 28.1
    p95: 112.5
    p99: 202.7
  Codes:
    200: 512

Report @ 22:23:54(+0200) 2020-05-20
Elapsed time: 1 minute, 52 seconds
  Scenarios launched:  185
  Scenarios completed: 186
  Requests completed:  556
  Mean response/sec: 55.6
  Response time (msec):
    min: 4.2
    max: 457
    median: 32.6
    p95: 279.7
    p99: 409.4
  Codes:
    200: 556

Report @ 22:24:04(+0200) 2020-05-20
Elapsed time: 2 minutes, 2 seconds
  Scenarios launched:  196
  Scenarios completed: 194
  Requests completed:  586
  Mean response/sec: 58.98
  Response time (msec):
    min: 4.1
    max: 247.7
    median: 27.5
    p95: 97.4
    p99: 183.1
  Codes:
    200: 586

Report @ 22:24:05(+0200) 2020-05-20
Elapsed time: 2 minutes, 3 seconds
  Scenarios launched:  15
  Scenarios completed: 19
  Requests completed:  51
  Mean response/sec: 37.3
  Response time (msec):
    min: 4.5
    max: 114.3
    median: 27.1
    p95: 96.5
    p99: 114.1
  Codes:
    200: 51

All virtual users finished
Summary report @ 22:24:05(+0200) 2020-05-20
  Scenarios launched:  1482
  Scenarios completed: 1482
  Requests completed:  4446
  Mean response/sec: 36.68
  Response time (msec):
    min: 4
    max: 457
    median: 27
    p95: 97.2
    p99: 232.7
  Scenario counts:
    Sign in, send a new message and fetch a list of chats: 1482 (100%)
  Codes:
    200: 4446